In [58]:
import sqlite3

In [59]:
## Connect to an SQLite database
connection=sqlite3.connect('testdb.db')
connection

In [56]:
cursor=connection.cursor()

In [50]:
connection.commit()

In [52]:
## Create a Table
cursor.execute('''
Create Table If Not Exists employees(
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    department text
    )
''')
connection.commit()
connection.close()

In [57]:
cursor.execute('''
Select * from employees
    
''')

In [45]:
## Insert the data in sqlite table
cursor.execute('''
Insert Into employees(name,age,department)
        values('Rajat',46,'Data Scientist')
        
''')

cursor.execute('''
INSERT INTO employees (name, age, department)
VALUES ('Bobi', 25, 'Engineering')
''')

cursor.execute('''
INSERT INTO employees (name, age, department)
VALUES ('Charu', 35, 'Finance')
''')

## commi the changes
connection.commit()
connection.close()

In [51]:
## Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
    print(row)

(1, 'Rajat', 46, 'Data Scientist')
(2, 'Bobi', 25, 'Engineering')
(3, 'Charu', 35, 'Finance')
(4, 'Rajat', 46, 'Data Scientist')
(5, 'Bobi', 25, 'Engineering')
(6, 'Charu', 35, 'Finance')

In [32]:
## Update the data in the table
cursor.execute('''
UPDATE employees
Set name="Rana"
where id=8
''')
connection.commit()

In [12]:
## Query the data from the table
cursor.execute('Select id,name from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
    print(row)

(1, 'Rajat')
(2, 'Bobi')
(3, 'Charu')

In [42]:
## Delete the data from the table
cursor.execute('''
Delete from employees
               where name ='Bob'
''')

connection.commit()

In [43]:
## Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
    print(row)

(1, 'Rajat', 46, 'Data Scientist')
(2, 'Bobi', 25, 'Engineering')
(3, 'Charu', 35, 'Finance')

In [ ]:
## Working Wwith Sales Data
# Connect to an SQLite database
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

# Create a table for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales (
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)
''')

# Insert data into the sales table
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]
cursor.executemany('''
Insert into sales(date,product,sales,region)
                   values(?,?,?,?)
''',sales_data)

In [22]:
# Query data from the sales table
cursor = connection.cursor()
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')
(6, '2023-01-01', 'Product1', 100, 'North')
(7, '2023-01-02', 'Product2', 200, 'South')
(8, '2023-01-03', 'Product1', 150, 'East')
(9, '2023-01-04', 'Product3', 250, 'West')
(10, '2023-01-05', 'Product2', 300, 'North')
(11, '2023-01-01', 'Product1', 100, 'North')
(12, '2023-01-02', 'Product2', 200, 'South')
(13, '2023-01-03', 'Product1', 150, 'East')
(14, '2023-01-04', 'Product3', 250, 'West')
(15, '2023-01-05', 'Product2', 300, 'North')
(16, '2023-01-01', 'Product1', 100, 'North')
(17, '2023-01-02', 'Product2', 200, 'South')
(18, '2023-01-03', 'Product1', 150, 'East')
(19, '2023-01-04', 'Product3', 250, 'West')
(20, '2023-01-05', 'Product2', 300, 'North')
(21, '2023-01-01', 'Product1', 100, 'North')
(22, '2023-01-02', 'Product2', 200, 'South')
(23, '2023-01-03', 'Product1', 150, 'East')
(24, '2023-01-04', 'Product3', 250, 'West')
(25, '2023-01-05', 'Product2', 300, 'North')
(26, '2023-01-01', 'Product1', 100, 'North')
(27, '2023-01-02', 'Product2', 200, 'South')
(28, '2023-01-03', 'Product1', 150, 'East')
(29, '2023-01-04', 'Product3', 250, 'West')
(30, '2023-01-05', 'Product2', 300, 'North')

In [17]:
## close the connection
connection.close()

In [23]:
# Query data from the sales table

cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')
(6, '2023-01-01', 'Product1', 100, 'North')
(7, '2023-01-02', 'Product2', 200, 'South')
(8, '2023-01-03', 'Product1', 150, 'East')
(9, '2023-01-04', 'Product3', 250, 'West')
(10, '2023-01-05', 'Product2', 300, 'North')
(11, '2023-01-01', 'Product1', 100, 'North')
(12, '2023-01-02', 'Product2', 200, 'South')
(13, '2023-01-03', 'Product1', 150, 'East')
(14, '2023-01-04', 'Product3', 250, 'West')
(15, '2023-01-05', 'Product2', 300, 'North')
(16, '2023-01-01', 'Product1', 100, 'North')
(17, '2023-01-02', 'Product2', 200, 'South')
(18, '2023-01-03', 'Product1', 150, 'East')
(19, '2023-01-04', 'Product3', 250, 'West')
(20, '2023-01-05', 'Product2', 300, 'North')
(21, '2023-01-01', 'Product1', 100, 'North')
(22, '2023-01-02', 'Product2', 200, 'South')
(23, '2023-01-03', 'Product1', 150, 'East')
(24, '2023-01-04', 'Product3', 250, 'West')
(25, '2023-01-05', 'Product2', 300, 'North')
(26, '2023-01-01', 'Product1', 100, 'North')
(27, '2023-01-02', 'Product2', 200, 'South')
(28, '2023-01-03', 'Product1', 150, 'East')
(29, '2023-01-04', 'Product3', 250, 'West')
(30, '2023-01-05', 'Product2', 300, 'North')

In [24]:
import sqlite3 # convert to 
import pandas as pd
db = sqlite3.connect('sales_data.db')
data = pd.read_sql_query("Select *from sales",db)
df = pd.DataFrame(data) #SQL JOIN WITH PANDAS
# df
df.describe()

              id       sales
count  25.000000   25.000000
mean   13.000000  200.000000
std     7.359801   72.168784
min     1.000000  100.000000
25%     7.000000  150.000000
50%    13.000000  200.000000
75%    19.000000  250.000000
max    25.000000  300.000000